Revit 2026 API

# ExtrusionRoofCurtainGrids Property

---

Retrieve all the CurtainGrid objects of a curtain Roof.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainGridSet CurtainGrids { get; }
```
```vb
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
```
```cpp
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
```
```fsharp
member CurtainGrids : CurtainGridSet with get
```

#### Property Value

CurtainGridSet

Only when the object is a CurtainRoof, this property makes sense.

#### Reference

ExtrusionRoof Class

Autodesk.Revit.DB Namespace